tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "saulpw/vd"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "coreutils"
brew "bats-core"
brew "pkg-config"
brew "cairo"
brew "imagemagick"
brew "chafa"
brew "ctags"
brew "datamash"
brew "dcmtk"
brew "entr"
brew "fd"
brew "gnuplot"
brew "feedgnuplot"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "htop"
brew "jq"
brew "lf"
brew "libpq"
brew "ripgrep"
brew "nb"
brew "nvm"
brew "pstree"
brew "stow"
brew "tmux"
brew "toilet"
brew "tree"
brew "vim"
brew "watch"
brew "yarn"
brew "zlib"
brew "saulpw/vd/visidata"
cask "1password"
cask "1password-cli"
cask "brave-browser"
cask "docker"
cask "dropbox"
cask "font-jetbrains-mono"
cask "intellij-idea"
cask "iterm2"
cask "keepassxc"
cask "pop"
cask "protonvpn"
cask "xbar"
cask "xquartz"
cask "zoom"
