tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "saulpw/vd"
brew "agg"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "coreutils"
brew "bats-core"
brew "cairo"
brew "harfbuzz"
brew "chafa"
brew "croc"
brew "ctags"
brew "datamash"
brew "dcmtk"
brew "emacs", restart_service: true
brew "entr"
brew "expect"
brew "eza"
brew "fd"
brew "gnuplot"
brew "feedgnuplot"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "git-gui"
brew "git-lfs"
brew "glow"
brew "gnu-apl"
brew "gnu-prolog"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "libheif"
brew "graphicsmagick"
brew "netpbm"
brew "graphviz"
brew "gron"
brew "helix"
brew "hexyl"
brew "htop"
brew "httpyac"
brew "hyperfine"
brew "libraw"
brew "imagemagick"
brew "jc"
brew "jq"
brew "kotlin"
brew "kotlin-language-server"
brew "ktlint"
brew "lazygit"
brew "less"
brew "lf"
brew "libpq"
brew "llm"
brew "moreutils"
brew "ripgrep"
brew "nb"
brew "nushell"
brew "nvm"
brew "ollama"
brew "openssl@1.1"
brew "tree"
brew "pass"
brew "patat"
brew "pkgconf"
brew "plantuml"
brew "pstree"
brew "pv"
brew "python@3.10"
brew "rlwrap"
brew "rust-analyzer"
brew "shellcheck"
brew "shfmt"
brew "shunit2"
brew "sl"
brew "slides"
brew "solargraph"
brew "stow"
brew "structurizr-cli"
brew "syncthing", restart_service: true
brew "texinfo"
brew "tidy-html5"
brew "timg"
brew "tmux"
brew "toilet"
brew "tokei"
brew "up"
brew "vim"
brew "watch"
brew "yarn"
brew "zlib"
brew "saulpw/vd/visidata"
cask "1password"
cask "1password-cli"
cask "brave-browser"
cask "chatgpt"
cask "chromedriver"
cask "docker"
cask "dropbox"
cask "font-jetbrains-mono"
cask "intellij-idea"
cask "iterm2"
cask "keepassxc"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "mitmproxy"
cask "ngrok"
cask "pop"
cask "protonvpn"
cask "session-manager-plugin"
cask "slack"
cask "tunnelblick"
cask "visual-studio-code"
cask "wireshark"
cask "xbar"
cask "xquartz"
cask "zerotier-one"
cask "zoom"
vscode "ms-vsliveshare.vsliveshare"
