tap "clojure/tools"
tap "drone/drone"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "rhyeal/aws-rotate-iam-keys", "https://github.com/rhyeal/aws-rotate-iam-keys"
tap "saulpw/vd"
tap "xwmx/taps"
brew "a2ps"
brew "aerc"
brew "giflib"
brew "libpng"
brew "gmp"
brew "libmpc"
brew "gcc"
brew "openssl@3"
brew "open-mpi"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bash"
brew "bash-completion", link: false
brew "bash-completion@2"
brew "bat"
brew "coreutils"
brew "bats-core"
brew "boost"
brew "bore-cli"
brew "broot"
brew "freetype"
brew "gettext"
brew "pixman"
brew "cairo"
brew "carthage"
brew "gdk-pixbuf"
brew "harfbuzz"
brew "pango"
brew "chafa"
brew "tesseract"
brew "zeromq"
brew "ffmpeg"
brew "cowsay"
brew "ctags"
brew "dasel"
brew "w3m"
brew "dasht"
brew "datamash"
brew "deno"
brew "doctl"
brew "dotnet"
brew "dtc"
brew "dust"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "elm"
brew "tree-sitter"
brew "emacs"
brew "encfs"
brew "entr"
brew "jpeg"
brew "libtool"
brew "erlang"
brew "exiftool"
brew "eza"
brew "fd"
brew "qt"
brew "gnuplot"
brew "feedgnuplot"
brew "fftw"
brew "fluid-synth"
brew "fzf"
brew "gawk"
brew "gdb"
brew "gh"
brew "ghc"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "git-lfs"
brew "glow"
brew "gnu-sed"
brew "gnucobol"
brew "gnupg"
brew "go"
brew "pkg-config"
brew "gource"
brew "openjdk"
brew "gradle"
brew "graphicsmagick"
brew "graphviz"
brew "gron"
brew "guile"
brew "helix"
brew "hexyl"
brew "hledger"
brew "htop"
brew "hyperfine"
brew "libheif"
brew "imagemagick"
brew "intltool"
brew "libyaml"
brew "jc"
brew "jq"
brew "kakoune"
brew "kotlin"
brew "ktlint"
brew "less"
brew "lf"
brew "libelf"
brew "links"
brew "llm"
brew "llvm"
brew "minicom"
brew "mitmproxy"
brew "moreutils"
brew "mpc"
brew "mpd"
brew "ncmpcpp"
brew "neofetch"
brew "neovim"
brew "newsboat"
brew "nushell"
brew "ocaml"
brew "pyqt"
brew "qscintilla2"
brew "texinfo"
brew "octave"
brew "ollama"
brew "pandoc"
brew "paps"
brew "tree"
brew "pass"
brew "poppler"
brew "pstree"
brew "pv"
brew "qt@5"
brew "python-lsp-server"
brew "python@3.10"
brew "redis"
brew "ripgrep"
brew "rlog"
brew "rlwrap"
brew "rust-analyzer"
brew "rustup-init"
brew "shellcheck"
brew "shunit2"
brew "sox"
brew "sshfs"
brew "stow"
brew "tarsnap"
brew "timg"
brew "tmux"
brew "toilet"
brew "tokei"
brew "viddy"
brew "vim"
brew "vis"
brew "watch"
brew "watchman"
brew "wireshark", link: false
brew "xdg-ninja"
brew "yarn"
brew "yq"
brew "zlib"
brew "zsh"
brew "clojure/tools/clojure"
brew "saulpw/vd/visidata"
brew "xwmx/taps/nb"
cask "alacritty"
cask "balenaetcher"
cask "basictex"
cask "bitbar"
cask "brave-browser"
cask "dropbox"
cask "gramps"
cask "keepassxc"
cask "meshlab"
cask "nomachine-enterprise-client"
cask "orion"
cask "protonmail-bridge"
cask "raspberry-pi-imager"
cask "transmission"
cask "utm"
cask "virtualbox"
cask "vnc-viewer"
cask "wireshark"
cask "xquartz"
cask "zerotier-one"
vscode "donjayamanne.githistory"
vscode "elmtooling.elm-ls-vscode"
vscode "hbenl.vscode-test-explorer"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.test-adapter-converter"
vscode "rust-lang.rust-analyzer"
vscode "sdras.night-owl"
vscode "vadimcn.vscode-lldb"
