tap "drone/drone"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "rhyeal/aws-rotate-iam-keys", "https://github.com/rhyeal/aws-rotate-iam-keys"
tap "saulpw/vd"
tap "xwmx/taps"
brew "a2ps"
brew "aerc"
brew "giflib"
brew "libpng"
brew "gmp"
brew "gcc"
brew "open-mpi"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bash"
brew "bash-completion", link: false
brew "bat"
brew "coreutils"
brew "bats-core"
brew "pkg-config"
brew "broot"
brew "freetype"
brew "gettext"
brew "pixman"
brew "cairo"
brew "carthage"
brew "harfbuzz"
brew "jpeg", link: true
brew "pango"
brew "chafa"
brew "cowsay"
brew "ctags"
brew "datamash"
brew "dtc"
brew "dust"
brew "folly"
brew "libtool"
brew "emacs"
brew "encfs"
brew "entr"
brew "exa"
brew "fizz"
brew "fb303"
brew "fd"
brew "gnuplot"
brew "feedgnuplot"
brew "zeromq"
brew "ffmpeg"
brew "fftw"
brew "fluid-synth"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "git-lfs"
brew "glow"
brew "gnu-sed"
brew "gnupg"
brew "gource"
brew "gradle"
brew "graphviz"
brew "gron"
brew "hexyl"
brew "hledger"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "intltool"
brew "jq"
brew "kakoune"
brew "less"
brew "lf"
brew "libelf"
brew "libyaml"
brew "links"
brew "mitmproxy"
brew "mpc"
brew "mpd"
brew "ncmpcpp"
brew "neofetch"
brew "neovim"
brew "newsboat"
brew "nushell"
brew "qscintilla2"
brew "texinfo"
brew "octave"
brew "openjdk"
brew "openssl@3"
brew "pandoc"
brew "paps"
brew "pstree"
brew "pv"
brew "pyqt"
brew "redis"
brew "ripgrep"
brew "rlog"
brew "rust-analyzer"
brew "rustup-init"
brew "shellcheck"
brew "shunit2"
brew "sox"
brew "sshfs"
brew "stow"
brew "tmux"
brew "toilet"
brew "tokei"
brew "tree"
brew "viddy"
brew "vim"
brew "vis"
brew "w3m"
brew "watch"
brew "watchman"
brew "xdg-ninja"
brew "yarn"
brew "zsh"
brew "saulpw/vd/visidata"
brew "xwmx/taps/nb"
cask "alacritty"
cask "balenaetcher"
cask "basictex"
cask "bitbar"
cask "gramps"
cask "keepassxc"
cask "meshlab"
cask "nomachine-enterprise-client"
cask "transmission"
cask "virtualbox"
cask "vnc-viewer"
cask "wireshark"
cask "xquartz"
cask "zerotier-one"
