tap "caskroom/cask"
tap "drone/drone"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "rhyeal/aws-rotate-iam-keys", "https://github.com/rhyeal/aws-rotate-iam-keys"
cask "osxfuse"
brew "autoconf"
brew "automake"
brew "aws-es-proxy"
brew "openssl@1.1"
brew "awscli"
brew "bash-completion"
brew "bat"
brew "boost-python"
brew "libpng"
brew "pixman"
brew "cairo"
brew "carthage"
brew "ctags"
brew "dtc"
brew "elinks"
brew "libtool"
brew "pkg-config"
brew "emacs"
brew "encfs"
brew "giflib"
brew "harfbuzz"
brew "jpeg"
brew "ffmpeg"
brew "libmpc"
brew "fftw"
brew "fzf"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "gnupg"
brew "gource"
brew "openjdk"
brew "gradle"
brew "pango"
brew "graphviz"
brew "imagemagick"
brew "intltool"
brew "jq"
brew "libelf"
brew "libyaml"
brew "mitmproxy"
brew "mpc"
brew "mpd"
brew "ncmpcpp"
brew "pandoc"
brew "pgweb"
brew "postgresql"
brew "pstree"
brew "redis"
brew "ripgrep"
brew "rlog"
brew "shellcheck"
brew "shunit2"
brew "sox"
brew "sshfs"
brew "stow"
brew "terraform"
brew "terraform@0.11"
brew "texinfo"
brew "tmux"
brew "tree"
brew "vim"
brew "watchman"
brew "yarn"
brew "zeromq"
brew "zsh"
brew "rhyeal/aws-rotate-iam-keys/aws-rotate-iam-keys"
cask "android-studio"
cask "balenaetcher"
cask "basictex"
cask "bitbar"
cask "gramps"
cask "intel-haxm"
cask "java"
cask "keepassxc"
cask "pgweb"
cask "wireshark"
