tap "cryfs/tap"
tap "github/gh"
tap "saulpw/vd"
tap "xwmx/taps"
brew "bash"
brew "bat"
brew "coreutils"
brew "ctags"
brew "datamash"
brew "entr"
brew "exiftool"
brew "eza"
brew "fd"
brew "feedgnuplot"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "git-lfs"
brew "glow"
brew "gnu-prolog"
brew "gnu-sed"
brew "gnupg"
brew "graphviz"
brew "helix"
brew "hexyl"
brew "hledger"
brew "htop"
brew "hyperfine"
brew "jc"
brew "jq"
brew "juicefs"
brew "less"
brew "lf"
brew "moreutils"
brew "mosh"
brew "newsboat"
brew "nmap"
brew "nushell"
brew "ollama", restart_service: :changed
brew "pandoc"
brew "tree"
brew "pass"
brew "podman"
brew "pstree"
brew "pv"
brew "ripgrep"
brew "rlwrap"
brew "stow"
brew "syncthing", restart_service: :changed
brew "timg"
brew "tmux"
brew "toilet"
brew "tokei"
brew "vim"
brew "w3m"
brew "watch"
brew "saulpw/vd/visidata"
brew "xwmx/taps/nb"
cask "dotnet-sdk"
cask "font-jetbrains-mono"
cask "fuse-t"
cask "iterm2"
cask "keepassxc"
cask "mitmproxy"
cask "nomachine-enterprise-client"
cask "zerotier-one"
